{
    "replymsg": "",
    "text": [
        {
            "careerfeatureid": "1",
            "img": "https:\/\/www.cgsi.com\/cgsiresources\/resources\/01.jpg",
            "description": "“Lovin’ My Supportive and Kind Colleagues”\n\nIn my role here, I execute billings to the firm’s various clients. I liaise daily with various BUs, assisting them with payment matters and guiding them through finance-related processes and any queries they may have.\n\nI also complete journal entries, moving them from our internal system into relevant accounting systems, including reclassifying payments into correct cost centers.\n\nBeing part of the CGS International family, I have learnt that it is important to be kind to everyone you meet. You will never know when you might need their advice and help! I especially am thankful for many colleagues-turned-friends that I have met in my career journey here; they are especially helpful and make working life enjoyable. I also know that I have the support of great bosses that will aid in my career growth progression here.\n",
            "title": "Lim Shu Ping, Associate, Finance"
        },
        {
            "careerfeatureid": "2",
            "img": "https:\/\/www.cgsi.com\/cgsiresources\/resources\/2.jpg",
            "description": "“Opportunities for Growth and Upskilling”\n\nAt CGS International, I manage the firm’s Call Centre. As the name of my department suggests, we are the frontliners when it comes to customer liaison. Daily, we have various clients calling in, emailing, and messaging us to enquire on our financial products, investment solutions or any technical queries they may have about the iTrade platform. \n\nIn general, I oversee and ensure that all queries received are being answered correctly and replied within the stipulated KPI. As a Manager, I strive to improve the overall Customer Experience with my team, to reach “Gold Standards” through system enhancements and attending service-improvement trainings.\n\nIn addition, I am also involved with various projects, and this has greatly upgraded my skillsets. I am glad that the peers around me are willing to share their experience and give guidance, imparting their knowledge to me so that I can be an all-rounder.\n\nI enjoy working here as I get to experience the warmth of my fellow colleagues and am given continuous chances to improve and upskill myself!\n",
            "title": "Angeline Lin, Manager, Client Services"
        },
        {
            "careerfeatureid": "3",
            "img": "https:\/\/www.cgsi.com\/cgsiresources\/resources\/3.jpg",
            "description": "“I Strive for Excellence and Progress”\n\nI am leading a team of young salespeople, to provide our clients tailored investment solutions such as equities, bonds, mutual funds and more. On a day-to-day basis, my work consists of overseeing various business dealings, to ensure that our clients’ investment needs are properly met.\n \nI monitor the market conditions and advise clients, managing their portfolios and providing them support based on their requirements. Support rendered can range from execution of trades, provision of market news and research, to providing personalized financial solutions. As a new manager myself, I am learning to become better each day – and am thankful for the support of my bosses, who have been generously guiding me.\n\nTheir encouragement and sharing enables me to strive towards becoming a good mentor to the younger generation. The ability to overcome challenges and the satisfaction of achieving good results makes me enjoy my work here. I like to make my clients’ investment portfolios work, strive with my peers to achieve our common goals, and progress together with my staff, enabling them to excel and enhance the firm’s success.",
            "title": "Koh Yee Sze, Head, Multi-Product Sales"
        }
    ],
    "status": "SUCCESS"
}